app/controllers/admin/cart_controller.rb

    def add
      product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]

    def update
      product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]

    def remove
      product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]