app/controllers/admin/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"
---
    def index
      @categories = Category.order(:name).page(params[:page]).per(10)

INSERT INTO "categories" ("created_at", "name", "parent_id", "position", "slug", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2026-03-11 09:57:51.826673"], ["name", "Electronics"], ["parent_id", nil], ["position", 0], ["slug", "electronics"], ["updated_at", "2026-03-11 09:57:51.826673"]]
---
    def create
      @category = Category.new(category_params)
      if @category.save

UPDATE "categories" SET "name" = $1, "slug" = $2, "updated_at" = $3 WHERE "categories"."id" = $4  [["name", "New Name"], ["slug", "new-name"], ["updated_at", "2026-03-11 09:57:51.742661"], ["id", 7]]
---
    def update
      if @category.update(category_params)