app/controllers/admin/checkout_controller.rb

SELECT "coupons".* FROM "coupons" WHERE (UPPER(code) = $1) LIMIT $2  [[nil, "EXPIRED50"], ["LIMIT", 1]]
SELECT "gift_cards".* FROM "gift_cards" WHERE (UPPER(code) = $1) LIMIT $2  [[nil, "GC-25-PARTIAL"], ["LIMIT", 1]]
SELECT "coupons".* FROM "coupons" WHERE (UPPER(code) = $1) LIMIT $2  [[nil, "SUMMER25"], ["LIMIT", 1]]
SELECT "gift_cards".* FROM "gift_cards" WHERE (UPPER(code) = $1) LIMIT $2  [[nil, "GC-100-XXXX"], ["LIMIT", 1]]
---
    def index
      @cart_items = cart_items
      @subtotal_cents = cart_subtotal_cents
      @discount_cents = 0
      @applied_coupon = nil
      @applied_gift_card = nil
      discount_type = params[:discount_type].presence || (params[:discount_code].present? && params[:discount_type] != "gift_card" ? "coupon" : "gift_card")

      product_ids = @cart_items.map { |i| i[:product].id }

      if discount_type == "coupon" && params[:discount_code].present?
        coupon = Coupon.find_by("UPPER(code) = ?", params[:discount_code].to_s.strip.upcase)
        if coupon&.valid_for?(@subtotal_cents, user_id: current_user&.id, product_ids: product_ids)
          @applied_coupon = coupon
          @discount_cents = coupon.discount_amount(@subtotal_cents)
        end
      elsif discount_type == "gift_card" && params[:discount_code].present?
        gift_card = GiftCard.find_by("UPPER(code) = ?", params[:discount_code].to_s.strip.upcase)

SELECT "coupons".* FROM "coupons" WHERE (UPPER(code) = $1) LIMIT $2  [[nil, "WELCOME10"], ["LIMIT", 1]]
SELECT "coupons".* FROM "coupons" WHERE (UPPER(code) = $1) LIMIT $2  [[nil, "SUMMER25"], ["LIMIT", 1]]
SELECT "gift_cards".* FROM "gift_cards" WHERE (UPPER(code) = $1) LIMIT $2  [[nil, "GC-100-XXXX"], ["LIMIT", 1]]
SELECT 1 AS one FROM "gift_cards" WHERE LOWER("gift_cards"."code") = LOWER($1) AND "gift_cards"."id" != $2 LIMIT $3  [["code", "GC-100-XXXX"], ["id", 5], ["LIMIT", 1]]
---
    def create
      if params[:apply]
        redirect_to admin_checkout_path(discount_type: params[:discount_type], discount_code: params[:discount_code])
        return
      end

      discount_type = params[:discount_type].presence
      discount_code = params[:discount_code].to_s.strip

      coupon = nil
      gift_card = nil
      if discount_type == "coupon" && discount_code.present?
        coupon = Coupon.find_by("UPPER(code) = ?", discount_code.upcase)
      elsif discount_type == "gift_card" && discount_code.present?
        gift_card = GiftCard.find_by("UPPER(code) = ?", discount_code.upcase)

INSERT INTO "orders" ("coupon_discount", "coupon_id", "created_at", "customer_id", "final_amount", "gift_card_discount", "gift_card_id", "shipping_address_line1", "shipping_address_line2", "shipping_city", "shipping_country", "shipping_postal_code", "shipping_state", "status", "total_amount", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
      )

      Order.transaction do
        order.save!

INSERT INTO "order_line_items" ("created_at", "order_id", "product_id", "quantity", "unit_price_cents", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2026-03-09 10:09:49.922988"], ["order_id", 9], ["product_id", 14], ["quantity", 1], ["unit_price_cents", 2999], ["updated_at", "2026-03-09 10:09:49.922988"]]
UPDATE "products" SET "stock_quantity" = $1 WHERE "products"."id" = $2  [["stock_quantity", 1], ["id", 14]]
---
          qty = item[:quantity]
          raise "Insufficient stock" if product.stock_quantity < qty

          order.order_line_items.create!(
            product: product,
            quantity: qty,
            unit_price_cents: product.price
          )
          product.update_column(:stock_quantity, product.stock_quantity - qty)