app/controllers/admin/coupons_controller.rb

    def index
      @coupons = Coupon.order(created_at: :desc).page(params[:page]).per(10)
---
SELECT "coupons".* FROM "coupons" ORDER BY "coupons"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

    def create
      @coupon = Coupon.new(coupon_params)
      if @coupon.save
---
INSERT INTO "coupons" ("code", "created_at", "discount_type", "discount_value", "expiry_date", "max_discount", "min_cart_value", "per_user_limit", "start_date", "status", "updated_at", "usage_limit") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

    def update
      if @coupon.update(coupon_params)
---
UPDATE "coupons" SET "discount_value" = $1, "updated_at" = $2 WHERE "coupons"."id" = $3  [["discount_value", 15], ["updated_at", "2026-03-11 09:57:47.438647"], ["id", 5]]

    def destroy
      @coupon.destroy
---
DELETE FROM "coupons" WHERE "coupons"."id" = $1  [["id", 4]]

    def set_coupon
      @coupon = Coupon.find(params[:id])
---
SELECT "coupons".* FROM "coupons" WHERE "coupons"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]