app/controllers/admin/customers_controller.rb

    def index
      @customers = Customer.all
      @customers = @customers.where("name ILIKE ? OR email ILIKE ?", "%#{params[:q]}%", "%#{params[:q]}%") if params[:q].present?
      @customers = @customers.order(:name).page(params[:page]).per(10)
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

    def create
      @customer = Customer.new(customer_params)
      if @customer.save
---
INSERT INTO "customers" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2026-03-11 09:57:48.850847"], ["email", "new@example.com"], ["name", "New Customer"], ["password_digest", "[FILTERED]"], ["updated_at", "2026-03-11 09:57:48.850847"]]

    def update
      if @customer.update(customer_params)
---
UPDATE "customers" SET "name" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["name", "New Name"], ["updated_at", "2026-03-11 09:57:48.562729"], ["id", 6]]