app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "orders"
SELECT COUNT(*) FROM "products"
SELECT COUNT(*) FROM "customers"
SELECT COUNT(*) FROM "categories"
SELECT COUNT(*) FROM "coupons"
SELECT COUNT(*) FROM "gift_cards"
SELECT COUNT(*) FROM "products" WHERE (stock_quantity <= $1)  [[nil, 5]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" IN ($1, $2, $3, $4, $5)  [["id", 4], ["id", 8], ["id", 7], ["id", 6], ["id", 5]]
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT $1  [["LIMIT", 5]]
SELECT COUNT(*) AS "count_all", created_at::date AS "created_at_date" FROM "orders" WHERE (created_at >= $1) GROUP BY created_at::date  [[nil, "2026-03-02 05:53:30.642079"]]
SELECT COUNT(*) AS "count_all", created_at::date AS "created_at_date" FROM "orders" WHERE (created_at >= $1) GROUP BY created_at::date  [[nil, "2026-02-07 05:53:30.646099"]]
---
    def index
      @total_orders = Order.count
      @total_products = Product.count
      @total_customers = Customer.count
      @total_categories = Category.count
      @total_coupons = Coupon.count
      @total_gift_cards = GiftCard.count
      @low_stock_count = Product.low_stock.count
      @recent_orders = Order.includes(:customer).order(created_at: :desc).limit(5)
      @orders_by_day_7 = Order.where("created_at >= ?", 7.days.ago).group("created_at::date").count
      @orders_by_day_30 = Order.where("created_at >= ?", 30.days.ago).group("created_at::date").count