app/controllers/admin/gift_cards_controller.rb

SELECT "gift_cards".* FROM "gift_cards" ORDER BY "gift_cards"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
    def index
      @gift_cards = GiftCard.order(created_at: :desc).page(params[:page]).per(10)

INSERT INTO "gift_cards" ("balance", "code", "created_at", "expiry_date", "initial_balance", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      @gift_card = GiftCard.new(gift_card_params)
      @gift_card.balance = @gift_card.initial_balance if @gift_card.balance.blank?
      if @gift_card.save

UPDATE "gift_cards" SET "status" = $1, "updated_at" = $2 WHERE "gift_cards"."id" = $3  [["status", "expired"], ["updated_at", "2026-03-11 09:57:53.142858"], ["id", 13]]
---
    def update
      if @gift_card.update(gift_card_params)

DELETE FROM "gift_cards" WHERE "gift_cards"."id" = $1  [["id", 14]]
---
    def destroy
      @gift_card.destroy

SELECT "gift_cards".* FROM "gift_cards" WHERE "gift_cards"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
    def set_gift_card
      @gift_card = GiftCard.find(params[:id])