app/controllers/admin/orders_controller.rb

    def index
      @orders = Order.includes(:customer, :order_line_items)
      @orders = @orders.where(status: params[:status]) if params[:status].present?
      @orders = @orders.order(created_at: :desc).page(params[:page]).per(10)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 4], ["id", 8], ["id", 7], ["id", 6], ["id", 5], ["id", 3]]
SELECT "order_line_items".* FROM "order_line_items" WHERE "order_line_items"."order_id" IN ($1, $2)  [["order_id", 4], ["order_id", 3]]
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

    def update
      status = params.require(:order).permit(:status)[:status]
      if Order::STATUSES.include?(status)
        @order.update!(status: status)
---
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "processing"], ["updated_at", "2026-03-11 09:57:47.693356"], ["id", 2]]

    def export
      orders = Order.includes(:customer, order_line_items: :product).order(created_at: :desc)
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC