app/controllers/admin/products_controller.rb

    def create
      @product = Product.new(product_params)
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "name", "price", "slug", "status", "stock_quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
      if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = $1, "stock_quantity" = $2 WHERE "products"."id" = $3  [["updated_at", "2026-03-09 05:27:19.968019"], ["stock_quantity", 15], ["id", 32]]

    def destroy
      @product.destroy!
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 21]]

    def export
      products = Product.includes(:categories).order(:name)
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2)  [["id", 71], ["id", 66]]

    def bulk_action
      ids = (params[:product_ids] || []).reject(&:blank?)
      if ids.empty?
        redirect_to admin_products_path, alert: "Select at least one product."
        return
      end
      case params[:bulk_action]
      when "update"
        if params[:bulk_status].present?
          Product.where(id: ids).update_all(status: params[:bulk_status])
          redirect_to admin_products_path, notice: "Updated #{ids.size} product(s)."
        else
          redirect_to admin_products_path, alert: "Select a status to update."
        end
      when "destroy"
        deleted = 0
        skipped = []
        Product.where(id: ids).each do |p|
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 261], ["LIMIT", 1]]
UPDATE "products" SET "status" = $1 WHERE "products"."id" IN ($2, $3)  [["status", "active"], ["id", 259], ["id", 260]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]