app/controllers/admin/product_combos_controller.rb

SELECT "product_combos".* FROM "product_combos" ORDER BY "product_combos"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2)  [["id", 40], ["id", 39]]
---
    def index
      @product_combos = ProductCombo.includes(
        product_combo_triggers: :product,
        product_combo_free_products: :product
      ).order(created_at: :desc).page(params[:page]).per(10)

INSERT INTO "product_combos" ("is_active", "valid_from", "valid_to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["is_active", true], ["valid_from", nil], ["valid_to", nil], ["created_at", "2026-03-11 07:18:57.361242"], ["updated_at", "2026-03-11 07:18:57.361242"]]
---
    def create
      ProductCombo.reset_column_information
      pc = params[:product_combo] || {}
      attrs = {
        "is_active" => pc["is_active"] != "false",
        "valid_from" => pc["valid_from"].presence,
        "valid_to" => pc["valid_to"].presence
      }
      @product_combo = ProductCombo.new(attrs)
      build_combo_products_from_params(@product_combo)
      if @product_combo.save

DELETE FROM "product_combo_triggers" WHERE "product_combo_triggers"."id" = $1  [["id", 15]]
DELETE FROM "product_combo_free_products" WHERE "product_combo_free_products"."id" = $1  [["id", 15]]
---
    def update
      base = product_combo_base_params.to_h.slice("is_active", "valid_from", "valid_to")
      if @product_combo.update(base)
        @product_combo.product_combo_triggers.destroy_all
        @product_combo.product_combo_free_products.destroy_all

DELETE FROM "product_combos" WHERE "product_combos"."id" = $1  [["id", 12]]
---
    def destroy
      @product_combo.destroy

SELECT "product_combos".* FROM "product_combos" WHERE "product_combos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2, $3, $4)  [["id", 38], ["id", 40], ["id", 32], ["id", 35]]
---
    def set_product_combo
      @product_combo = ProductCombo.includes(product_combo_triggers: :product, product_combo_free_products: :product).find(params[:id])

SELECT "product_combo_triggers".* FROM "product_combo_triggers" WHERE "product_combo_triggers"."product_combo_id" = $1  [["product_combo_id", 2]]
SELECT "product_combo_free_products".* FROM "product_combo_free_products" WHERE "product_combo_free_products"."product_combo_id" = $1  [["product_combo_id", 2]]
---
    def build_combo_products_from_params(combo)
      pc_params = params[:product_combo] || {}
      trigger_ids = Array(pc_params[:trigger_product_ids]).reject(&:blank?).map(&:to_i).uniq
      free_ids = Array(pc_params[:free_product_ids]).reject(&:blank?).map(&:to_i).uniq
      trigger_qty = [pc_params[:trigger_quantity].to_i, 1].max
      free_qty = [pc_params[:free_quantity].to_i, 1].max

      trigger_ids.each { |pid| combo.product_combo_triggers.build(product_id: pid, quantity: trigger_qty) }
      free_ids.each { |pid| combo.product_combo_free_products.build(product_id: pid, quantity: free_qty) }