app/controllers/admin/sessions_controller.rb

SELECT "users".* FROM "users" WHERE (LOWER(email) = $1) LIMIT $2  [[nil, "admin@example.com"], ["LIMIT", 1]]
---
    def create
      user = User.find_by("LOWER(email) = ?", params[:email]&.downcase&.strip)