app/controllers/admin/users_controller.rb

    def index
      @users = User.includes(:roles).order(:name).page(params[:page]).per(10)
---
SELECT "users".* FROM "users" ORDER BY "users"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2026-03-11 10:12:22.269547"], ["email", "admin2@example.com"], ["name", "New Admin"], ["password_digest", "[FILTERED]"], ["updated_at", "2026-03-11 10:12:22.269547"]]

    def update
      update_params = user_params.to_h
      if update_params["password"].blank?
        update_params.delete("password")
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Updated Name"], ["updated_at", "2026-03-11 10:12:22.129484"], ["id", 90]]

    def destroy
      if @user.id == current_user.id
        redirect_to admin_users_path, alert: "You cannot delete yourself."
        return
      end
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 94]]