app/views/admin/dashboard/index.html.erb

    <div class="card">
      <div class="card-header"><%= t('dashboard.orders_last_7_days') %></div>
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT $1  [["LIMIT", 5]]

<script>
  (function() {
    const data = <%= raw @orders_by_day_7.sort.map { |k, v| { date: k.to_s, count: v } }.to_json %>;
    const labels = data.map(d => d.date);
    const values = data.map(d => d.count);
    if (labels.length === 0) {
      labels.push(new Date().toISOString().slice(0,10));
      values.push(0);
    }
    const ctx = document.getElementById('ordersChart');
    if (ctx) {
      new Chart(ctx, {
        type: 'bar',
        data: {
          labels: labels,
          datasets: [{
            label: '<%= j t('dashboard.orders') %>',
            data: values,
            backgroundColor: 'rgba(13, 110, 253, 0.5)',
            borderColor: 'rgb(13, 110, 253)',
            borderWidth: 1
          }]
---
SELECT COUNT(*) AS "count_all", created_at::date AS "created_at_date" FROM "orders" WHERE (created_at >= $1) GROUP BY created_at::date  [[nil, "2026-02-27 05:02:38.974674"]]