app/views/admin/customers/show.html.erb

SELECT COUNT(*) FROM "orders" WHERE "orders"."customer_id" = $1  [["customer_id", 12]]
---
  <dt class="col-sm-2">Orders</dt>
  <dd class="col-sm-10"><%= @customer.orders.count %></dd>