app/views/admin/orders/show.html.erb

SELECT "order_line_items".* FROM "order_line_items" WHERE "order_line_items"."order_id" = $1  [["order_id", 3]]
SELECT 1 AS one FROM "order_line_items" WHERE "order_line_items"."order_id" = $1 LIMIT $2  [["order_id", 4], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2)  [["id", 13], ["id", 14]]
---
        <tbody>
          <% if @order.order_line_items.any? %>
            <% @order.order_line_items.includes(:product).each do |li| %>