app/views/admin/checkout/index.html.erb

SELECT "gift_cards".* FROM "gift_cards" WHERE (UPPER(code) = $1) LIMIT $2  [[nil, "GC-25-PARTIAL"], ["LIMIT", 1]]
---
      <div class="card mb-4">
        <div class="card-header"><%= t('checkout.order_summary') %></div>