app/views/admin/categories/show.html.erb

SELECT 1 AS one FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1 LIMIT $2  [["category_id", 37], ["LIMIT", 1]]
SELECT "products".* FROM "products" INNER JOIN "product_categories" ON "products"."id" = "product_categories"."product_id" WHERE "product_categories"."category_id" = $1  [["category_id", 37]]
---
  <dd class="col-sm-10">
    <% if @category.products.any? %>