app/views/admin/products/_form.html.erb

      <div class="row">
        <%= f.collection_check_boxes :category_ids, Category.order(:name), :id, :name do |b| %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC