app/views/admin/products/index.html.erb

      <div class="col-md-2">
        <%= f.select :category_id, options_from_collection_for_select(Category.order(:name), :id, :name, params[:category_id]), { include_blank: t('products.all_categories') }, class: "form-select" %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC