app/views/admin/products/show.html.erb

  <dd class="col-sm-10">
    <% if @product.categories.any? %>
      <% @product.categories.each do |cat| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = $1  [["product_id", 59]]
SELECT 1 AS one FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = $1 LIMIT $2  [["product_id", 42], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = $1  [["product_id", 42]]