app/controllers/sessions_controller.rb

  def create
    customer = Customer.find_by("LOWER(email) = ?", params[:email]&.downcase&.strip)
---
SELECT "customers".* FROM "customers" WHERE (LOWER(email) = $1) LIMIT $2  [[nil, "customer1@example.com"], ["LIMIT", 1]]