app/models/coupon.rb

INSERT INTO "coupon_usages" ("coupon_id", "created_at", "discount_amount", "order_id", "updated_at", "used_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def record_usage!(order:, user_id: nil, discount_amount:)
    coupon_usages.create!(
      order: order,
      user_id: user_id,
      discount_amount: discount_amount,
      used_at: Time.current
    )