app/models/gift_card.rb

  def deduct!(amount_cents, order: nil)
    return false unless redeemable?
    amount = [amount_cents, balance].min
    return false if amount <= 0

    new_balance = balance - amount
    new_status = new_balance.zero? ? "redeemed" : "active"

    transaction do
      update!(balance: new_balance, status: new_status)
      gift_card_transactions.create!(
        order: order,
        amount: amount,
        transaction_type: "debit"
      )
---
INSERT INTO "gift_card_transactions" ("amount", "created_at", "gift_card_id", "order_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", 10000], ["created_at", "2026-03-10 05:58:25.145179"], ["gift_card_id", 5], ["order_id", 18], ["transaction_type", "debit"], ["updated_at", "2026-03-10 05:58:25.145179"]]

  def normalize_code
    self.code = code.to_s.upcase.strip.gsub(/\s+/, "") if code.present?
---
SELECT 1 AS one FROM "gift_cards" WHERE LOWER("gift_cards"."code") = LOWER($1) AND "gift_cards"."id" != $2 LIMIT $3  [["code", "GC-100-XXXX"], ["id", 5], ["LIMIT", 1]]