app/models/product_combo.rb

  def display_name
    trigger_part = product_combo_triggers.map { |t| "#{t.quantity}× #{t.product.name}" }.join(" + ")
    free_part = product_combo_free_products.map { |f| "#{f.quantity}× #{f.product.name}" }.join(" + ")
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]