app/views/admin/product_combos/_form.html.erb

      <select name="product_combo[trigger_product_ids][]" multiple class="form-select" size="6">
        <% Product.order(:name).each do |p| %>
          <option value="<%= p.id %>" <%= 'selected' if product_combo.product_combo_triggers.any? { |t| t.product_id == p.id } %>><%= p.name %></option>
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC
SELECT 1 AS one FROM "product_combo_triggers" WHERE "product_combo_triggers"."product_id" = $1 AND "product_combo_triggers"."product_combo_id" IS NULL LIMIT $2  [["product_id", 38], ["LIMIT", 1]]

      <label class="form-label"><%= t('product_combos.trigger_quantity') %></label>
      <input type="number" name="product_combo[trigger_quantity]" class="form-control" min="1" value="<%= product_combo.product_combo_triggers.first&.quantity || 1 %>">
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC

      <select name="product_combo[free_product_ids][]" multiple class="form-select" size="6">
        <% Product.order(:name).each do |p| %>
          <option value="<%= p.id %>" <%= 'selected' if product_combo.product_combo_free_products.any? { |f| f.product_id == p.id } %>><%= p.name %></option>
---
SELECT "products".* FROM "products" ORDER BY "products"."name" ASC
SELECT 1 AS one FROM "product_combo_free_products" WHERE "product_combo_free_products"."product_id" = $1 AND "product_combo_free_products"."product_combo_id" IS NULL LIMIT $2  [["product_id", 40], ["LIMIT", 1]]