app/views/admin/product_combos/index.html.erb

SELECT "product_combo_triggers".* FROM "product_combo_triggers" WHERE "product_combo_triggers"."product_combo_id" IN ($1, $2)  [["product_combo_id", 2], ["product_combo_id", 1]]
---
              <td>
                <% combo.product_combo_triggers.each do |t| %>

SELECT "product_combo_free_products".* FROM "product_combo_free_products" WHERE "product_combo_free_products"."product_combo_id" IN ($1, $2)  [["product_combo_id", 2], ["product_combo_id", 1]]
---
              <td>
                <% combo.product_combo_free_products.each do |f| %>