app/views/admin/product_combos/show.html.erb

      <dd class="col-sm-9">
        <% @product_combo.product_combo_triggers.each do |t| %>
---
SELECT "product_combo_triggers".* FROM "product_combo_triggers" WHERE "product_combo_triggers"."product_combo_id" = $1  [["product_combo_id", 1]]

      <dd class="col-sm-9">
        <% @product_combo.product_combo_free_products.each do |f| %>
---
SELECT "product_combo_free_products".* FROM "product_combo_free_products" WHERE "product_combo_free_products"."product_combo_id" = $1  [["product_combo_id", 1]]