app/controllers/concerns/cart_support.rb

SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2)  [["id", 42], ["id", 40]]
---
  def cart_items
    items = []
    product_ids = (cart.keys + cart_free_gifts.keys).map(&:to_i).uniq
    products = Product.where(id: product_ids).index_by(&:id)

SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2)  [["id", 40], ["id", 39]]
---
  def cart_qualifying_combos
    return [] if cart.blank?

    combos = ProductCombo.active.valid_now
                          .includes(product_combo_triggers: :product, product_combo_free_products: :product)
    result = []

    combos.each do |combo|