app/views/admin/coupons/index.html.erb

              <td><%= coupon.min_cart_value.positive? ? number_to_currency(coupon.min_cart_value / 100.0) : "—" %></td>
              <td><%= coupon.coupon_usages.count %><%= " / #{coupon.usage_limit}" if coupon.usage_limit.present? %></td>
---
SELECT "coupons".* FROM "coupons" ORDER BY "coupons"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "coupon_usages" WHERE "coupon_usages"."coupon_id" = $1  [["coupon_id", 4]]